{
  "Device": [
    {
      "name": "Current Limits",
      "summary": "",
      "description": "",
      "ordinal": 0,
      "configs": [
        {
          "name": "Stator Current Limit",
          "summary": "The amount of current allowed in the motor (motoring and regen current).  Note this requires StatorCurrentLimitEnable to be true.\n\nFor torque current control, this is applied in addition to the PeakForwardTorqueCurrent and PeakReverseTorqueCurrent in TorqueCurrentConfigs.\n\nStator current is directly proportional to torque, so this limit can be used to restrict the torque output of the motor, such as preventing wheel slip for a drivetrain.  Additionally, stator current limits can prevent brownouts during acceleration; supply current will never exceed the stator current limit and is often significantly lower than stator current.\n\nA reasonable starting point for a stator current limit is 120 A, with values commonly ranging from 80-160 A. Mechanisms with a hard stop may need a smaller limit to reduce the torque applied when running into the hard stop.",
          "ordinal": 0,
          "type": "double",
          "description": "",
          "units": "A",
          "min_value": 0,
          "max_value": 800,
          "signal_id": 1906,
          "signal_name": "Config_StatorCurrentLimit",
          "default_value": 120,
          "value": 60,
          "param_value": 60,
          "enum_values": []
        }
      ]
    },
    {
      "name": "Closed Loop General",
      "summary": "",
      "description": "",
      "ordinal": 0,
      "configs": [
        {
          "name": "Continuous Wrap",
          "summary": "Wrap position error within [-0.5, \u002B0.5) mechanism rotations.  Typically used for continuous position closed-loops like swerve azimuth.",
          "ordinal": 0,
          "type": "bool",
          "description": "This uses the mechanism rotation value. If there is a gear ratio between the sensor and the mechanism, make sure to apply a SensorToMechanismRatio so the closed loop operates on the full rotation.",
          "units": "",
          "min_value": -1.7976931348623157E+308,
          "max_value": 1.7976931348623157E+308,
          "signal_id": 1985,
          "signal_name": "Config_ContinuousWrap",
          "default_value": 0,
          "value": 1,
          "param_value": true,
          "enum_values": []
        }
      ]
    },
    {
      "name": "Slot 0",
      "summary": "",
      "description": "",
      "ordinal": 0,
      "configs": [
        {
          "name": "Static Feedforward Sign",
          "summary": "Static feedforward sign during position closed loop.\n\nThis determines the sign of the applied kS during position closed-loop modes. The default behavior uses the velocity reference sign. This works well with velocity closed loop, Motion Magic® controls, and position closed loop when velocity reference is specified (motion profiling).\n\nHowever, when using position closed loop with zero velocity reference (no motion profiling), the application may want to apply static feedforward based on the sign of closed loop error instead. When doing so, we recommend using the minimal amount of kS, otherwise the motor output may dither when closed loop error is near zero.",
          "ordinal": 9,
          "type": "StaticFeedforwardSignValue",
          "description": "",
          "units": "",
          "min_value": -1.7976931348623157E+308,
          "max_value": 1.7976931348623157E+308,
          "signal_id": 2114,
          "signal_name": "Slot0_kS_Sign",
          "default_value": 0,
          "value": 1,
          "param_value": "UseClosedLoopSign",
          "enum_values": [
            {
              "name": "UseVelocitySign",
              "comment": "Use the velocity reference sign. This works well with velocity closed loop, Motion Magic® controls, and position closed loop when velocity reference is specified (motion profiling).",
              "value": 0
            },
            {
              "name": "UseClosedLoopSign",
              "comment": "Use the sign of closed loop error. This is useful when using position closed loop with zero velocity reference (no motion profiling). We recommend the minimal amount of kS, otherwise the motor output may dither when closed loop error is near zero.",
              "value": 1
            }
          ]
        }
      ]
    },
    {
      "name": "Feedback",
      "summary": "",
      "description": "",
      "ordinal": 0,
      "configs": [
        {
          "name": "Feedback Remote Sensor ID",
          "summary": "Device ID of which remote device to use.  This is not used if the Sensor Source is the internal rotor sensor.",
          "ordinal": 0,
          "type": "int",
          "description": "",
          "units": "",
          "min_value": 0,
          "max_value": 62,
          "signal_id": 1921,
          "signal_name": "Config_FeedbackRemoteSensorID",
          "default_value": 0,
          "value": 31,
          "param_value": 31,
          "enum_values": []
        },
        {
          "name": "Feedback Sensor Source",
          "summary": "Choose what sensor source is reported via API and used by closed-loop and limit features.  The default is RotorSensor, which uses the internal rotor sensor in the Talon.\n\nChoose Remote* to use another sensor on the same CAN bus (this also requires setting FeedbackRemoteSensorID).  Talon will update its position and velocity whenever the remote sensor publishes its information on CAN bus, and the Talon internal rotor will not be used.\n\nChoose Fused* (requires Phoenix Pro) and Talon will fuse another sensor\u0027s information with the internal rotor, which provides the best possible position and velocity for accuracy and bandwidth (this also requires setting FeedbackRemoteSensorID).  This was developed for applications such as swerve-azimuth.\n\nChoose Sync* (requires Phoenix Pro) and Talon will synchronize its internal rotor position against another sensor, then continue to use the rotor sensor for closed loop control (this also requires setting FeedbackRemoteSensorID).  The Talon will report if its internal position differs significantly from the reported remote sensor position.  This was developed for mechanisms where there is a risk of the sensor failing in such a way that it reports a position that does not match the mechanism, such as the sensor mounting assembly breaking off.\n\nChoose RemotePigeon2Yaw, RemotePigeon2Pitch, and RemotePigeon2Roll to use another Pigeon2 on the same CAN bus (this also requires setting FeedbackRemoteSensorID).  Talon will update its position to match the selected value whenever Pigeon2 publishes its information on CAN bus. Note that the Talon position will be in rotations and not degrees.",
          "ordinal": 0,
          "type": "FeedbackSensorSourceValue",
          "description": "Note: When the feedback source is changed to Fused* or Sync*, the Talon needs a period of time to fuse before sensor-based (soft-limit, closed loop, etc.) features are used. This period of time is determined by the update frequency of the remote sensor\u0027s Position signal.",
          "units": "",
          "min_value": -1.7976931348623157E+308,
          "max_value": 1.7976931348623157E+308,
          "signal_id": 1920,
          "signal_name": "Config_FeedbackSensorSource",
          "default_value": 0,
          "value": 1,
          "param_value": "RemoteCANcoder",
          "enum_values": [
            {
              "name": "RotorSensor",
              "comment": "Use the internal rotor sensor in the Talon.",
              "value": 0
            },
            {
              "name": "RemoteCANcoder",
              "comment": "Use another CANcoder on the same CAN bus (this also requires setting FeedbackRemoteSensorID).  Talon will update its position and velocity whenever CANcoder publishes its information on CAN bus, and the Talon internal rotor will not be used.",
              "value": 1
            },
            {
              "name": "RemotePigeon2Yaw",
              "comment": "Use another Pigeon2 on the same CAN bus (this also requires setting FeedbackRemoteSensorID).  Talon will update its position to match the Pigeon2 yaw whenever Pigeon2 publishes its information on CAN bus. Note that the Talon position will be in rotations and not degrees.",
              "value": 2
            },
            {
              "name": "RemotePigeon2Pitch",
              "comment": "Use another Pigeon2 on the same CAN bus (this also requires setting FeedbackRemoteSensorID).  Talon will update its position to match the Pigeon2 pitch whenever Pigeon2 publishes its information on CAN bus. Note that the Talon position will be in rotations and not degrees.",
              "value": 3
            },
            {
              "name": "RemotePigeon2Roll",
              "comment": "Use another Pigeon2 on the same CAN bus (this also requires setting FeedbackRemoteSensorID).  Talon will update its position to match the Pigeon2 roll whenever Pigeon2 publishes its information on CAN bus. Note that the Talon position will be in rotations and not degrees.",
              "value": 4
            },
            {
              "name": "FusedCANcoder",
              "comment": "Requires Phoenix Pro; Talon will fuse another CANcoder\u0027s information with the internal rotor, which provides the best possible position and velocity for accuracy and bandwidth (this also requires setting FeedbackRemoteSensorID).  FusedCANcoder was developed for applications such as swerve-azimuth.",
              "value": 5
            },
            {
              "name": "SyncCANcoder",
              "comment": "Requires Phoenix Pro; Talon will synchronize its internal rotor position against another CANcoder, then continue to use the rotor sensor for closed loop control (this also requires setting FeedbackRemoteSensorID).  The Talon will report if its internal position differs significantly from the reported CANcoder position.  SyncCANcoder was developed for mechanisms where there is a risk of the CANcoder failing in such a way that it reports a position that does not match the mechanism, such as the sensor mounting assembly breaking off.",
              "value": 6
            },
            {
              "name": "RemoteCANdiPWM1",
              "comment": "Use a pulse-width encoder remotely attached to the Sensor Input 1 (S1IN) on the CTR Electronics\u0027 CANdi™ (this also requires setting FeedbackRemoteSensorID). Talon will update its position and velocity whenever the CTR Electronics\u0027 CANdi™ publishes its information on CAN bus, and the Talon internal rotor will not be used.",
              "value": 9
            },
            {
              "name": "RemoteCANdiPWM2",
              "comment": "Use a pulse-width encoder remotely attached to the Sensor Input 2 (S2IN) on the CTR Electronics\u0027 CANdi™ (this also requires setting FeedbackRemoteSensorID). Talon will update its position and velocity whenever the CTR Electronics\u0027 CANdi™ publishes its information on CAN bus, and the Talon internal rotor will not be used.",
              "value": 10
            },
            {
              "name": "RemoteCANdiQuadrature",
              "comment": "Use a quadrature encoder remotely attached to the two Sensor Inputs on the CTR Electronics\u0027 CANdi™ (this also requires setting FeedbackRemoteSensorID). Talon will update its position and velocity whenever the CTR Electronics\u0027 CANdi™ publishes its information on CAN bus, and the Talon internal rotor will not be used.",
              "value": 11
            },
            {
              "name": "FusedCANdiPWM1",
              "comment": "Requires Phoenix Pro; Talon will fuse a pulse-width encoder remotely attached to the Sensor Input 1 (S1IN) on the CTR Electronics\u0027 CANdi™, which provides the best possible position and velocity for accuracy and bandwidth (this also requires setting FeedbackRemoteSensorID).  FusedCANdi was developed for applications such as swerve-azimuth.",
              "value": 12
            },
            {
              "name": "FusedCANdiPWM2",
              "comment": "Requires Phoenix Pro; Talon will fuse a pulse-width encoder remotely attached to the Sensor Input 2 (S2IN) on the CTR Electronics\u0027 CANdi™, which provides the best possible position and velocity for accuracy and bandwidth (this also requires setting FeedbackRemoteSensorID).  FusedCANdi was developed for applications such as swerve-azimuth.",
              "value": 13
            },
            {
              "name": "FusedCANdiQuadrature",
              "comment": "Requires Phoenix Pro; Talon will fuse a qaudrature encoder remotely attached to the two Sensor Inputs on the CTR Electronics\u0027 CANdi™. This provides velocity and relative position measurements. This also requires setting FeedbackRemoteSensorID.",
              "value": 14
            },
            {
              "name": "SyncCANdiPWM1",
              "comment": "Requires Phoenix Pro; Talon will synchronize its internal rotor position against the pulse-width encoder attached to Sensor Input 1 (S1IN), then continue to use the rotor sensor for closed loop control (this also requires setting FeedbackRemoteSensorID).  The Talon will report if its internal position differs significantly from the reported PWM position.  SyncCANdi was developed for mechanisms where there is a risk of the CTR Electronics\u0027 CANdi™ failing in such a way that it reports a position that does not match the mechanism, such as the sensor mounting assembly breaking off.",
              "value": 15
            },
            {
              "name": "SyncCANdiPWM2",
              "comment": "Requires Phoenix Pro; Talon will synchronize its internal rotor position against the pulse-width encoder attached to Sensor Input 1 (S1IN), then continue to use the rotor sensor for closed loop control (this also requires setting FeedbackRemoteSensorID).  The Talon will report if its internal position differs significantly from the reported PWM position.  SyncCANdi was developed for mechanisms where there is a risk of the CTR Electronics\u0027 CANdi™ failing in such a way that it reports a position that does not match the mechanism, such as the sensor mounting assembly breaking off.",
              "value": 16
            }
          ]
        },
        {
          "name": "Rotor To Sensor Ratio",
          "summary": "The ratio of motor rotor rotations to remote sensor rotations, where a ratio greater than 1 is a reduction.\n\nThe Talon FX is capable of fusing a remote CANcoder with its rotor sensor to produce a high-bandwidth sensor source.  This feature requires specifying the ratio between the motor rotor and the remote sensor.\n\nIf this is set to zero, the device will reset back to one.",
          "ordinal": 0,
          "type": "double",
          "description": "",
          "units": "scalar",
          "min_value": -1000,
          "max_value": 1000,
          "signal_id": 1919,
          "signal_name": "Config_RotorToSensorRatio",
          "default_value": 1,
          "value": 25.899999618530273,
          "param_value": 25.899999618530273,
          "enum_values": []
        }
      ]
    },
    {
      "name": "Motion Magic",
      "summary": "",
      "description": "",
      "ordinal": 0,
      "configs": [
        {
          "name": "Motion Magic Expo_kV",
          "summary": "This is the target kV used only by Motion Magic® Expo control modes. Unlike the kV slot gain, this is always in units of V/rps.\n\nThis represents the amount of voltage necessary to hold a velocity. In terms of the Motion Magic® Expo profile, a higher kV results in a slower maximum velocity.",
          "ordinal": -2,
          "type": "double",
          "description": "",
          "units": "V/rps",
          "min_value": 0.001,
          "max_value": 100,
          "signal_id": 1947,
          "signal_name": "Config_MotionMagicExpo_kV",
          "default_value": 0.12,
          "value": 0.11999999731779099,
          "param_value": 0.11999999731779099,
          "enum_values": []
        },
        {
          "name": "Motion Magic Expo_kA",
          "summary": "This is the target kA used only by Motion Magic® Expo control modes. Unlike the kA slot gain, this is always in units of V/rps².\n\nThis represents the amount of voltage necessary to achieve an acceleration. In terms of the Motion Magic® Expo profile, a higher kA results in a slower acceleration.",
          "ordinal": -1,
          "type": "double",
          "description": "",
          "units": "V/rps²",
          "min_value": 1E-05,
          "max_value": 100,
          "signal_id": 1948,
          "signal_name": "Config_MotionMagicExpo_kA",
          "default_value": 0.1,
          "value": 0.10000000149011612,
          "param_value": 0.10000000149011612,
          "enum_values": []
        }
      ]
    }
  ],
  "JsonVersion": 2
}